results/i5-2400S-OSX-10.10.3/go_02.txt
Running 20s test @ http://localhost:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78ms    2.57ms 108.57ms   98.04%
    Req/Sec    15.38k   745.87    20.34k    85.75%
  Latency Distribution
     50%    1.51ms
     75%    1.63ms
     90%    1.92ms
     99%   10.32ms
  1225512 requests in 20.02s, 155.44MB read
Requests/sec:  61210.36
Transfer/sec:      7.76MB