results/i5-2400S-OSX-10.10.3/nim_rc_04.txt
Running 20s test @ http://localhost:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.33ms    1.43ms  37.92ms   88.00%
    Req/Sec    11.74k   551.34    13.06k    67.25%
  Latency Distribution
     50%    1.75ms
     75%    1.89ms
     90%    4.55ms
     99%    7.44ms
  935149 requests in 20.01s, 66.89MB read
Requests/sec:  46723.82
Transfer/sec:      3.34MB